Revit 2027 API
MultiReferenceAnnotationOptions.IsAllowedDimensionStyleType Method
 Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAllowedDimensionStyleType(
	DimensionStyleType dimensionStyleType
)
Public Function IsAllowedDimensionStyleType (
	dimensionStyleType As DimensionStyleType
) As Boolean
public:
bool IsAllowedDimensionStyleType(
	DimensionStyleType dimensionStyleType
)
member IsAllowedDimensionStyleType :
        dimensionStyleType : DimensionStyleType -> bool
Parameters
dimensionStyleType DimensionStyleType
 The dimension style type to test.
Return Value
Boolean
 True if the type is allowed.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace